In [6]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv("./data_with_nan.csv")
df

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
3    NaN   NaN  NaN
4  test5   NaN  bbb
5    NaN   NaN  NaN

In [3]:
df["col3"][0]

nan

In [4]:
type(df["col3"][0])

float

In [5]:
type(None)

NoneType

In [7]:
np.nan

nan

In [8]:
df["col1"].isna()

0    False
1    False
2    False
3     True
4    False
5     True
Name: col1, dtype: bool

In [9]:
df[df["col1"].isna()]

  col1  col2 col3
3  NaN   NaN  NaN
5  NaN   NaN  NaN

In [10]:
df[df["col1"].notna()]

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
4  test5   NaN  bbb

In [11]:
df

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
3    NaN   NaN  NaN
4  test5   NaN  bbb
5    NaN   NaN  NaN

In [12]:
df["col2"].fillna(0)

0    13.0
1    44.0
2     0.0
3     0.0
4     0.0
5     0.0
Name: col2, dtype: float64

In [13]:
df["col1"].ffill()

0    test1
1    test2
2    test3
3    test3
4    test5
5    test5
Name: col1, dtype: object

In [14]:
df["col1"].bfill()

0    test1
1    test2
2    test3
3    test5
4    test5
5      NaN
Name: col1, dtype: object

In [16]:
df

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
2  test3   NaN  NaN
3    NaN   NaN  NaN
4  test5   NaN  bbb
5    NaN   NaN  NaN

In [18]:
df.dropna(thresh=2)

    col1  col2 col3
0  test1  13.0  NaN
1  test2  44.0  aaa
4  test5   NaN  bbb